<%@ page contentType="text/html; charset=UTF-8" %><ol>
<li>研究方向</li>
<li></li>
</ol>
<p>整个算法的过程中，</p>
<ol>
<li>一直都会参与计算的，整体都是不断迭代的</li>
<li>有些的一些部分，会计算的部分会不断减小的</li>
</ol>
<p>有哪些算法是会最后会不参与计算的</p>
<p>流水线用多线程解决
集中控制器，对于空闲的节点直接调度资源进行计算，。
是否是调度，和不同的在于是否需要全部的图。</p>
<p>这个计算集群额时候，调度，对。
1.</p>
<p>梳理一下算法，之前的那些点都搞清楚了，之后才比较有意思。出东西了。
可能会到调度的领域去了了</p>
<ol>
<li>经典的图计算的算法。</li>
<li>能不能把分解，计算过程。</li>
</ol>
<p>扩展访问范围</p>
<p>有没有人研究这个问题？？还是说有这个问题，但最后容易落入俗套的调度问题。
针对图计算有没有特定的问题？
看下现有的那些框架是否有这些问题和？</p>
<p>国家自然基金
2. 背景、意义，很有意思的
3. 国内外研究现状，哪些团队，要比较全的
4. 研究思路、研究方法。</p>
<p>要写周报</p>
<p>RA=Base+竞争</p>
