<%@ page contentType="text/html; charset=UTF-8" %><p>转自：<a href="http://wap.sciencenet.cn/blogview.aspx?id=994019&amp;from=singlemessage&amp;isappinstalled=0">http://wap.sciencenet.cn/blogview.aspx?id=994019&amp;from=singlemessage&amp;isappinstalled=0</a>
作者：龚明</p>
<p>今年研究生面试碰到一些问题，现总结如下，希望对未来的学生参加入学面试有一定帮助。 一家之言，仅供参考。</p>
<!--more-->
<h2>关于自我介绍的问题</h2>
<p>面试时间紧迫，一般不会给你很长时间做自我介绍，所以要简明扼要。好多学生面试的时候是这样说的：各位老师大家好，我叫某某，来自某大学;我学习过什么，成绩如何，在班级排名如何，参加过什么社团；平时喜欢做什么；参加过哪些竞赛；获得过哪些奖励/奖学金;进过哪些实验室；做过哪些研究等等。</p>
<p>这不是一个好的自我介绍，它有几个显著问题。 第一，太复杂以及有太多无用的信息，比如学校的奖学金以及参加各种社团，我觉得意义不大；第二， 无重点、无目的性以及无针对性； 第三，严重超时。如果你希望表现你组织能力强，你可以说“我组织能力强，是xx社团的主席”，这是可以的。很多人其实只是某些社团的一个普通人员，就没有必要大肆渲染了。关于第二点，是最致命的，我们最希望听到的是学生主动介绍自己希望做什么事情。今年我们面试的几十个人中无一人主动这样说。自我介绍严重超时会影响我们后续的提问时间。</p>
<p>我最喜欢的自我介绍大概如下：各位老师大家好，我叫某某，来自哪个大学，成绩，排名以及获得过哪些重要的奖励，最后重点介绍自己的研究经历和研究兴趣。这一点大家可以参考“非诚勿扰”“中国好声音”等节目，一般他们的介绍都是：“大家好，我叫某某，哪里人，多少岁”，非常简洁。一般让你来参加面试，已经表明你具有相当优势，所以面试的时候，我们会更加看中你的研究兴趣、反应能力和应答能力、基础知识以及为此所做的准备。所以希望学生能更多介绍自己的研究兴趣、为此所付出的努力以及取得的成果。</p>
<h2>关于研究兴趣的问题</h2>
<p>兴趣是成功的关键，我们不希望学生选择一个自己不感兴趣的方向。在面试的几十个人过程中，没有一个人主动介绍自己的兴趣和未来的研究方向，让人失望。我们必须主动问，你想做什么啊，学生才会回答。那为什么啊？他们会回答：“前几天听了某某老师的报告，觉得很有趣，所以想去做”。这样回答问题的学生比例很高。我也见到学生在短短几天内不停变换自己的兴趣。这些其实也暴露出我们大学在培养学生方面存在的问题，我们灌输了大量的知识，可是却忘记了培养他们的兴趣。</p>
<p>和兴趣相关的另外一个问题是，我们的学生极少主动去查询和调研某些东西。所以就算是他们通过某些报告了解了一些新的概念，他们也不会主动去网上找一些相关的资料来了解这些概念的基本含义。他们对有些问题的理解，基本是科普级别的。满足于接受知识，而不是主动探寻知识，可能是学生中普遍存在的另外一个问题。这些学生成绩都很优秀，可能他们平时更多的精力是放在学习上，而缺乏主动了解课本外知识的欲望。</p>
<h2>关于主动联系导师的问题</h2>
<p>绝大部分的学生不会主动和导师联系。出国的学生都知道要主动联系导师“陶瓷”，国内的学生这个意识要淡薄得多。如果和老师联系过，一般可以事先有一个见面和讨论，这个互相了解的过程让后面录取的几率大得多。如果不和老师联系，仅凭面试的结果，是很难让导师做出是否录取你的决定的。要知道绝大部分老师是不参加面试的。在有些学校/单位，可能是先不选导师，等入学后再确定，这样还有录取的希望。但是如果学校要求先确定导师才能录取，那么几率就很小了。无论哪种情况，事先搜索导师的研究方向，读读他们的论文以及和感兴趣的导师联系，对于录取是非常重要的。这个过程的另外一个好处是在面试阶段可以更好地表明自己的研究兴趣，也证明自己曾经尝试去调研过某些内容。</p>
<p>追求公平的学生可能会想，这不公平。世界上不可能有100%的公平。面试的时候，学生的背景不同，兴趣不同，我们也会问不同的问题。另外一个原因是为了避免学生泄露考题，相信大家都可以理解这一点。有些问题可能简单，运气好的话就被你碰到了。有些问题可能比较困难，考生未必答得上来。面试的技巧见第四点。一般来说，导师每年录取学生的名额都是有限的，而且在读研和博士的5年中，学生的素质直接决定了未来工作的好坏以及进展的快慢，所以老师把机会留给最有可能来他组以及他最了解的学生，这是再正常不过的了。</p>
<h2>关于面试回答问题的技巧</h2>
<p>面试的一个重要目的是希望检查学生的反映能力以及思考问题的能力。所以我们不希望学生低着头不停地想问题，而让时间一秒一秒溜走。如果回答不上来，其实也没有什么，就就干脆说忘记了/不会/没有学过，我们会立刻问你其它问题。有一个学生让我印象深刻，当时问他非线性晶体的问题。他就说：我忘记细节了，太久了，但是应该是这样的。然后在那里笔划o光是什么样子，e光是什么样子，并努力重建光在非线性晶体中的基本图像。我们觉得很好，表面上它呈现了一个不完整的图像，实际上我们也看到了一个学生思考问题的方式以及对基础知识的驾驭能力。这个学生最终我们给了录取通知书，一般这样的考生往往会得较高的评价。</p>
<h2>关于本科时做过的科研</h2>
<p>有部分同学在大学的时候在一些组做过部分研究。绝大部分学生其实没有真正参与到里面去，所以只能介绍个大概，一问就穿帮了。有少数是做进去了，也取得了一些结果，可是由于不懂得原理，一问也什么都回答不上来。在介绍科研经历的时候，可以采取一些策略。首先介绍一些实验室/组在做的事情以及它的目的和意义，然后介绍自己在里面所做的事情以及自己对这些问题的理解。在介绍理解的时候，可以努力把问题和自己学习过的教材联系在一起。比如有一个学生做薄膜的，他完全可以努力联想到量子力学、固体物理等课程以及这些课程中二维系统特殊的物理性质。再比如做离子，那么就努力联想到原子物理、光学等课程。其它学科的课程也差不多，事实上基于课本而超越课本一直是研究的主要研究方法。目前没有任何一个领域和大学的基础知识无关，相反，走得越远，基础知识的重要性越显著。所以一方面希望学生在做实验室的时候努力把自己的研究内容和基础知识联系在一起，另外在面试的时候也努力表达出这种关联。如果可以表达自己对这些问题的看法，以及未来的设想(未必完全正确，没有关系)，以及通过这些研究加深了对某个书本知识的理解，那就更好了。</p>
<h2>关于什么样的学生更容易被录取</h2>
<p>面试本质上是人与人的交流，所以善于交流和表达的学生最容易被录取。大学老师也不可能什么都懂，自然也不会期望学生什么都懂。因此，莫要紧张；当碰到不懂的问题的时候，勇敢地说出来，这样有机会回答其它问题；此外也要用于表达自己的观点和想法。我觉得几乎所有的面试都应该如此吧。</p>
