<%@ page contentType="text/html; charset=UTF-8" %><p>转自：<a href="http://www.kaoyan.com/fushi/jingyan/56bd942407d3b.html">http://www.kaoyan.com/fushi/jingyan/56bd942407d3b.html</a>
作者：佚名</p>
<p>每年考研复试之前，考生最纠结的一个问题就是要不要联系导师。对这个问题也是众说纷纭。帮帮特针对联系导师这一问题，整理了相关的答疑，希望对大家有所帮助。</p>
<!--more-->
<h2>常见问题</h2>
<h3>1、现在可以联系导师了吗？</h3>
<p>　　可以，但要懂得方法，别让老师烦你就好。</p>
<h3>2、联系之前须要了解导师的情况吗？</h3>
<p>　　这个是必须的。一般来说，我们建议从以下几个方面去了解你未来的导师。导师的经历、当下的工作状况、学术研究情况、师生相处情况。</p>
<p>　　导师的经历主要是指导师的籍贯、学习经历、工作经历；当下工作状况主要是指职称、是否兼有行政职务；学术研究情况是指导师出版的著作、发表的文章、在其研究领域的学术立场、学术研究风格；师生相处情况指导师对学生的态度、原则、要求以及日常交往情况，甚至导师生活中的某些个人喜好等等，这些情况主要从日常教学和师生交往（尤其是节庆日公共活动）中了解。</p>
<h3>3、如何联系导师呢？</h3>
<p>　　邮件是最好的方式，须要注意邮件的格式。
　　打电话也可以，但要事先准备好谈话的提纲，并注意打电话的礼节。</p>
<h3>4、用邮件联系导师须要注意什么呢？</h3>
<p>　　用邮件联系导师时，首先要特别注意邮件的写作格式和用语。邮件格式正确与否，显示的是你个人的职业素养，用语准确与否显示的是你个人的文化素养。</p>
<p>　　其次，关于邮件的内容很重要。联系导师主要是告诉导师报考他研究生的信心以及决心，其次是显示出自己的能力和可塑性，再次是给导师留下好的印象。</p>
<p>　　最后，写邮件时要特别注意内容的结构与逻辑性，切记要反复打草稿，直到你搞清所写内容之间的关系。</p>
<h3>4、导师不回我的邮件怎么办？</h3>
<p>　　导师一般都不会回邮件，除非你先前和他有过交流。
　　即使你遇到了不回邮件的情况，也不要着急。不回邮件的可能原因很多，而你前面一封高质量的邮件如果已经让导师看过，并留下了良好的印象，也会有助于你的成功。</p>
<h3>5、电话联系导师须要注意什么呢？</h3>
<p>　　如果你一定要打电话，可以参照如下的流程：</p>
<p>　　1）编制与导师电话沟通的内容提纲，包括开场问候语、问题大纲及结束语。</p>
<p>　　2）如果是手机联系，要先发短信告知，简单介绍自己，并询问他接电话是否方便。</p>
<p>　　3）得到导师回复确认后，隔3～5分钟再拔打，但时间间隔不要过长。如果导师表示现在时间不方便，可以再以短信形式进一步沟通方便的时间，导师确认后，自己在短信形式回复，表示谨记，会在约定的时间打电话（注意可以表示正式沟通前，会再短信与导师确认一下）。</p>
<p>　　4)如果导师没有回复短信，隔段时间再发，如果还不回，请别再用电话联系。</p>
<p>　　5）如果是联系导师的办公电话，可以在工作时间拔打。须要注意的是：首先要询问对方是不是XX教授（事先了解其正确的职务），得到确认后，简短表明本次电话的意图，并询问导师是不是方便。如果得到肯定回答，则按事先拟好的提纲沟通；如果导师表示不方便，可以约一下时间，表达沟通的意愿。</p>
<h3>6、给导师送礼物就一定能保证被录取吗？</h3>
<p>　　这个很难说，也不好说。</p>
<h3></h3>
<p>7、与导师沟通什么内容比较合适呢？ ###</p>
<p>　　沟通的内容一般来说是由你自身的情况来确定的，但下面的内容可以做参与。个人基本情况（如姓名、年龄、性别），学习情况（毕业学校（非应届生可介绍工作单位与经历）、本科所学过的主要课程），毕业论文题目与要点，曾经阅读过的主要书籍，研究方向和兴趣等。若导师有兴趣，便会增加成功的机率。</p>
<h3>8、我想提前去见导师，能见到么？</h3>
<p>　　这要看你去见的导师是怎么样的一个人，他是否愿意接见你。
　　行动之前，一定要与导师进行沟通确认（建议沟通的时候采取委婉的方式），如果得到确认，即可去见。如果导师表示不方便，则最好不要去见了。</p>
<h3>9、导师愿意接见我，有没有必要带土特产？</h3>
<p>　　礼多人不怪！
　　如果导师都答应见你了，空着手去总不是一件好吧，送礼，人之常情嘛，当然，有就带，没有就不带，礼不在贵而富有家乡特色就好。</p>
<h3>10、联系导师时有哪些忌讳的地方？</h3>
<p>　　1）忌讳之一：过分向导师了解某些信息。</p>
<p>　　导师能理解考生迫切的求学心情，但决不能容忍过分的要求，尤其不要表现的急功近利。
　　一些初试合格的学生，会通过电话、邮件、乃至导师的同事、熟人来了解复试的内容、复试导师的组成等等。绝大多数导师对此是反感的，因为这不利于了解考生的正确情况、不利于选择自己所需要的学生、干扰了正常的招生工作。据了解，大部分导师不但不会泄漏复试内容，反而对这些考生会有一些抵触反感情绪。</p>
<p>　　2）忌讳之二：过于频繁地联系导师。</p>
<p>　　虽然考生确实有必要与导师联系，但提醒考生一定要注意频率。如果反复打电话与导师联系，可能影响导师的教学科研工作的进行，乃至影响导师的正常工作与生活，效果可能会适得其反。</p>
<p>　　3）忌讳之三：询问毕业后就业问题。</p>
<p>　　就业是学生的大事，但不是导师的头等大事。作为导师，更关心考生对学术的追求，因为他们是知识传授者而非工作介绍者。不要因为一个不是现在的问题，让导师对你失去兴趣。</p>
<p>　　4）忌讳之四：探听导师隐私并让导师知晓</p>
<p>　　了解导师的信息，决不是要探寻导师的隐私。让人知道你在探听他的隐私，那么他会怀疑你的品德，因而会留下极其负面的影响。</p>
<p>　　5）忌讳之五：第一次接触不太成功后的消极自我暗示。</p>
<p>　　有些考生在第一次与导师接触后，感觉导师不够热情，或者觉得自己表现不好，给导师留下了不好的印象，便消极悲观，这是片面的、不科学的。导师第一次和陌生学生接触时，不会表现出强烈的感情倾向，因此不必过于在意导师的热情程度。切记，第一印象固然重要，但即使第一次接触不顺利，在进一步的联系中还可修复第一次的不足表现。</p>
<p>　　来这里，突破复试最后一道防线。</p>
