<%@ page contentType="text/html; charset=UTF-8" %><ol>
<li>
<p>这四个表是之前就有用 Excel 导出来打印的吗？有之前用过的表可以参考吗？</p>
</li>
<li>
<p>这四个表怎么用的问题？就是说这个表你会怎么用？
a. 供应商对账表是间隔几个月都是和别人对表用的？
b. 供应商每月明细是一个对一次用的？
c. 客户的相应</p>
</li>
<li>
<p>颜色是什么？打印时候的底色？</p>
</li>
<li></li>
</ol>
<p>进退货的问题</p>
<p>下拉有显示</p>
<p>照片添加作为附件</p>
<p>再加一个利润率，客户是每个月还是每一年？</p>
<p>汇款单位是有时候不是那个供应商开出来的票，是让别人开的（需要记录就好）</p>
<p>汇款方式：微信、现金、公帐、私汇</p>
<p>需要手动输入、可能还要加图（退款单、出货单、收据）</p>
<p>裸装、客户自己选装数</p>
<p>编码是C88，跟编码，</p>
<p>买是怎么买的？</p>
<p>产品名称	编号	包装明细	单价(元/包)	    单位	    装数	    箱数      金额	扣除运费(回扣)
靓靓刷	A013		            0.58	    箱	       300      88	    123123</p>
<p>产品名称	编号	包装明细	单价(元/包)	    单位	    个数	金额	扣除运费(回扣)
靓靓刷（散装）	A013		    0.58	    个		        123123</p>
<p>记忆功能就是要为了便于输入的问题。</p>
